//
//  ConstantsEnum.swift
//  MyFootballTeamApp
//
//  Created by Никита Козловский on 31.10.2024.
//

import UIKit

enum MockDataEnums {
    static let menu: [String] = ["Таблица", "Календарь", "Состав команды", "Топ бомбардиров", "Топ ассистентов"]
    
    static let homeTeam: [String] = [
        "Боавишта", "Спарта Москва", "Боавишта", "Хаджиме", "Боавишта", "Эдельвейс Юг", "Боавишта"
    ]
    
    static let guestTeam: [String] = [
        "Кентавр", "Боавишта", "Молоково", "Боавишта", "Орехово Юг", "Боавишта", "Пассага"
    ]
    
    static let tourNumber: [Int] = [25, 26, 27, 28, 29, 30, 31]

}

enum PlayersMockData {
    
    static let playersPhoto: [UIImage] = [
        UIImage(named: "Алексей") ?? UIImage(),
        UIImage(named: "Антон") ?? UIImage(),
        UIImage(named: "Олейник") ?? UIImage(),
        UIImage(named: "СаняФ") ?? UIImage(),
        UIImage(named: "Кирилл") ?? UIImage(),
        UIImage(named: "МаксФил") ?? UIImage(),
        UIImage(named: "ДавидА") ?? UIImage(),
        UIImage(named: "Крепыш") ?? UIImage(),
        UIImage(named: "Дьяк") ?? UIImage(),
        UIImage(named: "Муртуз") ?? UIImage(),
        UIImage(named: "Фара") ?? UIImage(),
        UIImage(named: "Вальк") ?? UIImage(),
        UIImage(named: "ДавидА") ?? UIImage(),
        UIImage(named: "Тимур") ?? UIImage(),
        UIImage(named: "Дятлов") ?? UIImage(),
        UIImage(named: "Глеб") ?? UIImage(),
        UIImage(named: "Овсян") ?? UIImage(),
        UIImage(named: "Жел") ?? UIImage(),
        UIImage(named: "Козел") ?? UIImage(),
        UIImage(named: "Егор") ?? UIImage(),
        UIImage(named: "Старый") ?? UIImage(),
        UIImage(named: "СаняС") ?? UIImage(),
        UIImage(named: "Холод") ?? UIImage(),
        UIImage(named: "ДаняА") ?? UIImage()
    ]
    
    static let playersNames: [String] = [
        "МОСКВИН АЛЕКСЕЙ АНТОНОВИЧ",
        "НИКИТИН АНТОН ПАВЛОВИЧ",
        "ОЛЕЙНИК НИКИТА АЛЕКСЕЕВИЧ",
        "ФЕДУЛИН АЛЕКСАНДР ВЛАДИМИРОВИЧ",
        "СТОЛОНОГОВ КИРИЛЛ АНДРЕЕВИЧ",
        "ФИЛИППОВ МАКСИМ ВЛАДИМИРОВИЧ",
        "АРАКЕЛЯН ДАВИД АРТУРОВИЧ",
        "КАРПУХИН СЕРГЕЙ ОЛЕГОВИЧ",
        "ДЬЯКОВ ДМИТРИЙ ЮРЬЕВИЧ",
        "МУСАЕВ МУРТАЗАЛИ МУСАЕВИЧ",
        "ШАРИФОВ ФАРРУХ ГУЛМАХМАДОВИЧ",
        "ВАЛЬКОВАННЫЙ СЕРГЕЙ ВИКТОРОВИЧ",
        "ГОЛЕТИАНИ ДАВИД ГОЧЕВИЧ",
        "КРАСОВСКИЙ ТИМУР АНДРЕЕВИЧ",
        "ДЯТЛОВ НИКИТА ЮРЬЕВИЧ",
        "СТРЕЛЬНИКОВ ГЛЕБ РОМАНОВИЧ",
        "ОВСЯННИКОВ АЛЕКСАНДР ОЛЕГОВИЧ",
        "ЖЕЛОНКИН НИКИТА ВЛАДИСЛАВОВИЧ",
        "КОЗЛОВСКИЙ НИКИТА ВЛАДИСЛАВОВИЧ",
        "КОСЯКИН ЕГОР СЕРГЕЕВИЧ",
        "ДЕНИСОВ СЕРГЕЙ ЕВГЕНЬЕВИЧ",
        "САВЁЛОВ АЛЕКСАНДР МИХАЙЛОВИЧ",
        "ГОЛЕТИАНИ ДАВИД ГОЧЕВИЧ",
        "АВЕДЬЯН ДАНИИЛ АШОТОВИЧ"
        ]
    
    static let playersBirthdays: [String] = [
        "27.08.1999",
        "22.07.1983",
        "27.08.1994",
        "24.06.1992",
        "28.06.2003",
        "16.03.2005",
        "АРАКЕЛЯН ДАВИД АРТУРОВИЧ",
        "КАРПУХИН СЕРГЕЙ ОЛЕГОВИЧ",
        "ДЬЯКОВ ДМИТРИЙ ЮРЬЕВИЧ",
        "МУСАЕВ МУРТАЗАЛИ МУСАЕВИЧ",
        "ШАРИФОВ ФАРРУХ ГУЛМАХМАДОВИЧ",
        "ВАЛЬКОВАННЫЙ СЕРГЕЙ ВИКТОРОВИЧ",
        "ГОЛЕТИАНИ ДАВИД ГОЧЕВИЧ",
        "КРАСОВСКИЙ ТИМУР АНДРЕЕВИЧ",
        "ДЯТЛОВ НИКИТА ЮРЬЕВИЧ",
        "СТРЕЛЬНИКОВ ГЛЕБ РОМАНОВИЧ",
        "ОВСЯННИКОВ АЛЕКСАНДР ОЛЕГОВИЧ",
        "ЖЕЛОНКИН НИКИТА ВЛАДИСЛАВОВИЧ",
        "КОЗЛОВСКИЙ НИКИТА ВЛАДИСЛАВОВИЧ",
        "КОСЯКИН ЕГОР СЕРГЕЕВИЧ",
        "ДЕНИСОВ СЕРГЕЙ ЕВГЕНЬЕВИЧ",
        "САВЁЛОВ АЛЕКСАНДР МИХАЙЛОВИЧ",
        "ГОЛЕТИАНИ ДАВИД ГОЧЕВИЧ",
        "АВЕДЬЯН ДАНИИЛ АШОТОВИЧ"
        
        ]
}
